БухЭксп/Catalogs/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_НазначенияСтатусов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьПоБухгалтерскомуУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначатьДляНовыхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРассчитыватьСтатистикуДляПоследнего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_СтатусыДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СтатусыОбъектаМетаданных(ИмяОбъектаМетаданных) Экспорт
	
	НазначениеСтатуса = Справочники.CW_НазначенияСтатусов.ПолучитьНазначениеСтатусовПоТипуОбъекрта(ИмяОбъектаМетаданных);
	
	Результат = Новый Массив;
	
	Если НазначениеСтатуса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатусыДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	|ГДЕ
	|	CW_СтатусыДокументов.ПометкаУдаления = ЛОЖЬ
	|	И CW_СтатусыДокументов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	CW_СтатусыДокументов.Код
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Владелец", НазначениеСтатуса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатусНовогоОбъекта(ИмяОбъектаМетаданных) Экспорт
	
	НазначениеСтатуса = Справочники.CW_НазначенияСтатусов.ПолучитьНазначениеСтатусовПоТипуОбъекрта(ИмяОбъектаМетаданных);
	
	Если НазначениеСтатуса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_СтатусыДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	|ГДЕ
	|	CW_СтатусыДокументов.ПометкаУдаления = ЛОЖЬ
	|	И CW_СтатусыДокументов.Владелец = &Владелец
	|	И CW_СтатусыДокументов.НазначатьДляНовыхОбъектов = ИСТИНА";
	
	Запрос.УстановитьПараметр("Владелец", НазначениеСтатуса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура СоздатьСтатусНовогоОбъекта(Владелец, ПроводитьПоБухгалтерскомуУчету) Экспорт
	
	НовыйСтатус = Справочники.CW_СтатусыДокументов.СоздатьЭлемент();
	НовыйСтатус.Владелец 						= Владелец;
	НовыйСтатус.Наименование 					= "Новый";
	НовыйСтатус.ПроводитьПоБухгалтерскомуУчету 	= ПроводитьПоБухгалтерскомуУчету;
	НовыйСтатус.НазначатьДляНовыхОбъектов 		= Истина;
	НовыйСтатус.Комментарий 					= "Статус нового объекта";
	НовыйСтатус.Записать();
	
КонецПроцедуры

#КонецЕсли
